# DeleteAttribute

## Description
Deletes an attribute

```pascal
FUNCTION DeleteAttribute(
				XMLHandle   : LONGINT;
				elementPath : DYNARRAY[] of CHAR;
				attribute   : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.DeleteAttribute(XMLHandle, elementPath, attribute):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||
|elementPath|DYNARRAY[] of CHAR||
|attribute|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* XML